544675c6f971f7399a000e79
      
      
123456*
       IDENTIFICATION DIVISION.
       PROGRAM-ID. string-to-number.
       AUTHOR. "ejini战神".
       DATA DIVISION.
       LINKAGE SECTION.
       01 INPUT-VAR    PIC X(06).
       01 RESULT       PIC S9(06).
       PROCEDURE DIVISION USING INPUT-VAR RESULT.
           MOVE INPUT-VAR TO RESULT.
       END PROGRAM string-to-number.
_______________________
123456*
       IDENTIFICATION DIVISION.
       PROGRAM-ID. string-to-number.
       DATA DIVISION.
       LINKAGE SECTION.
       01 INPUT-VAR    PIC X(06).
       01 RESULT       PIC S9(06).
       PROCEDURE DIVISION USING INPUT-VAR RESULT.
           move input-var to result
           GOBACK.
       END PROGRAM string-to-number.
_______________________
123456*
       IDENTIFICATION DIVISION.
       PROGRAM-ID. string-to-number.
       DATA DIVISION.
       LINKAGE SECTION.
       01 INPUT-VAR    PIC X(06).
       01 RESULT       PIC S9(06).
      
       PROCEDURE DIVISION USING INPUT-VAR
                                RESULT.
      
      * good luck :)
       move input-var to result
           GOBACK.
       END PROGRAM string-to-number.
_______________________
123456*
       IDENTIFICATION DIVISION.
       PROGRAM-ID. string-to-number.
       DATA DIVISION.
       LINKAGE SECTION.
       01 S         PIC X(06).
       01 RES       PIC S9(06).
       PROCEDURE DIVISION USING S RES.
         MOVE S TO RES.
       END PROGRAM string-to-number.
      
