56c5847f27be2c3db20009c3
      
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTRACT-SUM.
       AUTHOR. "ejini战神".
       DATA DIVISION.
       LINKAGE SECTION.
       01 N           PIC 9(8).
       01 RESULT      PIC a(9).
       PROCEDURE DIVISION USING N RESULT.
           MOVE "apple" TO RESULT.
       END PROGRAM SUBTRACT-SUM.
_______________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTRACT-SUM.
       DATA DIVISION.
       LINKAGE SECTION.
       01 N           PIC 9(8).
       01 RESULT      PIC a(9).
       PROCEDURE DIVISION USING N RESULT.
       MOVE 'apple' TO RESULT.
       END PROGRAM SUBTRACT-SUM.

